simulacoes/newSolver/shockTube/sim2/0.orig/pB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
        //value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
        //value           uniform 0;
    }

    lowerWall
    {
        type            zeroGradient;
        //value           uniform 0;
    }

    upperWall
    {
        type            zeroGradient;
        //value           uniform 0;
    }

    frontWall
    {
        type            cyclic;
    }
    
    backWall
    {
        type            cyclic;
    }
}

// ************************************************************************* //
